var dMapPoints =[
    {"lng":116.418261,"lat":39.921984,"count":50},
    {"lng":116.423332,"lat":39.916532,"count":50},
    {"lng":116.419787,"lat":39.930658,"count":50},
    {"lng":116.418455,"lat":39.920921,"count":50},
    {"lng":116.418843,"lat":39.915516,"count":50},
    {"lng":116.42546,"lat":39.918503,"count":50},
    {"lng":116.423289,"lat":39.919989,"count":50},
    {"lng":116.418162,"lat":39.915051,"count":50},
    {"lng":116.422039,"lat":39.91782,"count":50},
    {"lng":116.41387,"lat":39.917253,"count":50},
    {"lng":116.41773,"lat":39.919426,"count":50},
    {"lng":116.421107,"lat":39.916445,"count":50},
    {"lng":116.417521,"lat":39.917943,"count":50},
    {"lng":116.419812,"lat":39.920836,"count":50},
    {"lng":116.420682,"lat":39.91463,"count":50},
    {"lng":116.415424,"lat":39.924675,"count":50},
    {"lng":116.419242,"lat":39.914509,"count":50},
    {"lng":116.422766,"lat":39.921408,"count":50},
    {"lng":116.421674,"lat":39.924396,"count":50},
    {"lng":116.427268,"lat":39.92267,"count":50},
    {"lng":116.417721,"lat":39.920034,"count":50},
    {"lng":116.412456,"lat":39.92667,"count":50},
    {"lng":116.420432,"lat":39.919114,"count":50},
    {"lng":116.425013,"lat":39.921611,"count":50},
    {"lng":116.418733,"lat":39.931037,"count":50},
    {"lng":116.419336,"lat":39.931134,"count":50},
    {"lng":116.413557,"lat":39.923254,"count":50},
    {"lng":116.418367,"lat":39.92943,"count":50},
    {"lng":116.424312,"lat":39.919621,"count":50},
    {"lng":116.423874,"lat":39.919447,"count":50},
    {"lng":116.424225,"lat":39.923091,"count":50},
    {"lng":116.417801,"lat":39.921854,"count":50},
    {"lng":116.417129,"lat":39.928227,"count":50},
    {"lng":116.426426,"lat":39.922286,"count":50},
    {"lng":116.421597,"lat":39.91948,"count":50},
    {"lng":116.423895,"lat":39.920787,"count":50},
    {"lng":116.423563,"lat":39.921197,"count":50},
    {"lng":116.417982,"lat":39.922547,"count":50},
    {"lng":116.426126,"lat":39.921938,"count":50},
    {"lng":116.42326,"lat":39.915782,"count":50},
    {"lng":116.419239,"lat":39.916759,"count":50},
    {"lng":116.417185,"lat":39.929123,"count":50},
    {"lng":116.417237,"lat":39.927518,"count":50},
    {"lng":116.417784,"lat":39.915754,"count":50},
    {"lng":116.420193,"lat":39.917061,"count":50},
    {"lng":116.422735,"lat":39.915619,"count":50},
    {"lng":116.418495,"lat":39.915958,"count":50},
    {"lng":116.416292,"lat":39.931166,"count":50},
    {"lng":116.419916,"lat":39.924055,"count":50},
    {"lng":116.42189,"lat":39.921308,"count":50},
    {"lng":116.413765,"lat":39.929376,"count":50},
    {"lng":116.418232,"lat":39.920348,"count":50},
    {"lng":116.417554,"lat":39.930511,"count":50},
    {"lng":116.418568,"lat":39.918161,"count":50},
    {"lng":116.413461,"lat":39.926306,"count":50},
    {"lng":116.42232,"lat":39.92161,"count":50},
    {"lng":116.4174,"lat":39.928616,"count":50},
    {"lng":116.424679,"lat":39.915499,"count":50},
    {"lng":116.42171,"lat":39.915738,"count":50},
    {"lng":116.417836,"lat":39.916998,"count":50},
    {"lng":116.420755,"lat":39.928001,"count":50},
    {"lng":116.414077,"lat":39.930655,"count":50},
    {"lng":116.426092,"lat":39.922995,"count":50},
    {"lng":116.41535,"lat":39.931054,"count":50},
    {"lng":116.413022,"lat":39.921895,"count":50},
    {"lng":116.415551,"lat":39.913373,"count":50},
    {"lng":116.421191,"lat":39.926572,"count":50},
    {"lng":116.419612,"lat":39.917119,"count":50},
    {"lng":116.418237,"lat":39.921337,"count":50},
    {"lng":116.423776,"lat":39.921919,"count":50},
    {"lng":116.417694,"lat":39.92536,"count":50}
    ];

var dinterestsData = [

    { value: 335, name: '时事' },
    { value: 310, name: '奥运' },
    { value: 335, name: '视频' },
    { value: 310, name: '校园' },
    { value: 335, name: '生活' },
    { value: 310, name: '娱乐' },
    { value: 335, name: '商业' },
    { value: 310, name: '科技' },
    { value: 335, name: '汽车' },
    { value: 310, name: '蜂蜜' }
]
var dManWomenData = [
    { value: 335, name: '男' },
    { value: 310, name: '女' }
]

var dAgeNum = [10, 10, 10, 10, 10, 10, 10];

var dAgeName = ['10-15', '16', '17', '18', '19', '20', '20-25'];

var dRate = 0;

//修改地域分布数据
fSetMapData(dMapPoints,100);
//修改转化率数据
fSetConversionData(60.44,config4);
//修改兴趣分布数据
fSetinterestsData(dinterestsData);
//修改男女占比数据
fSetManWomenData(dManWomenData);
//修改用户年龄分布
fSetpersonAgeData(dAgeName,dAgeNum);
//修改增长率数据
fSetrateData(dRate);